{
  "backend/main.mo": "Motoko actor providing fixed daily and random quotes plus basic reverse life clock stats using hardcoded values.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Plain-text mapping of frontend file paths to short functional summaries for build or documentation use.",
  "frontend/index.css": "Global Tailwind-based styles defining light and dark theme OKLCH tokens and applying base layout variables.",
  "frontend/index.html": "HTML entry point setting meta tags, mounting root element, and registering an auto-updating service worker.",
  "frontend/public/manifest.json": "PWA manifest defining metadata, theme colors, start URL, display mode, and icons.",
  "frontend/public/service-worker.js": "Service worker handling caching, versioned cache invalidation, navigation/network strategies, and update activation.",
  "frontend/src/App.tsx": "Root React component wrapping the dashboard with ThemeProvider set to system default and including global toasts.",
  "frontend/src/components/ChronographTimer.tsx": "Implements a study timer with start, pause, reset, millisecond display, and persistence, updating study time and showing related progress components.",
  "frontend/src/components/DailyQuote.tsx": "Fetches and displays a daily motivational quote with a loading skeleton state.",
  "frontend/src/components/DaysRemaining.tsx": "Calculates days left until a target date stored in localStorage and updates live, reacting to goal changes.",
  "frontend/src/components/ExecutionScore.tsx": "Displays an execution score tier based on today's logged study hours, with special handling before midday.",
  "frontend/src/components/FailureAlert.tsx": "Shows time‑based alerts if the user has zero study hours by 9 PM or missed the previous day.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and external link.",
  "frontend/src/components/ForwardLifeClock.tsx": "Displays a dynamic 'life‑clock' showing day of year, date, time units, and yearly progress with animated digit changes.",
  "frontend/src/components/GoalEditor.tsx": "Provides a dialog to configure goal name and dates, persists them to localStorage, and triggers updates.",
  "frontend/src/components/NotificationManager.tsx": "Handles notification permission prompts and sends periodic study reminders based on daily hours.",
  "frontend/src/components/NoZeroDaysIndicator.tsx": "Shows a colored indicator reflecting whether today's study hours are zero or active.",
  "frontend/src/components/PsychologicalTriggerBar.tsx": "Displays remaining days until a goal deadline, updating via localStorage and events.",
  "frontend/src/components/ReverseLifeClock.tsx": "Shows a countdown to a goal date with animated time units and tracks progress since the start date.",
  "frontend/src/components/StreakDisplay.tsx": "Displays current and longest study streaks and indicates when a streak is broken.",
  "frontend/src/components/StudyHeatmap.tsx": "Renders a weekly heatmap of study hours with tooltips and updates on study session events.",
  "frontend/src/components/StudyProgressBarChart.tsx": "Shows a 30‑day bar chart of daily study hours with dynamic bar heights and color coding.",
  "frontend/src/components/StudyTracker.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/ThemeModeDialog.tsx": "Provides a dialog for selecting light, dark, or system theme using radio options.",
  "frontend/src/components/TimeBasedMessage.tsx": "Displays a motivational message badge based on the current time of day.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for fetching a daily quote with caching and fallback, and utilities for managing study session data, streaks, and timer state in localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive light/dark theme CSS variables plus custom utilities and animations for the UI.",
  "frontend/src/lib/studyActivityColors.ts": "Exports color constants and helper functions to map study hours to activity levels and corresponding visualization colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard layout combining clocks, quotes, timers, study stats, and theme controls, updating time every second.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state for adding a header settings icon and minimal modal for theme switching, with instant theme application and localStorage persistence. Lists existing features, requirements, and a pending request for the theme selector."
}