{
  "backend/main.mo": "Motoko backend exposing static quotes, a deterministic random quote selector, a daily quote, and simple reverse life clock stats.",
  "feature_evidence.json": "Feature evidence report listing two features, their related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file and component.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH color tokens for light and dark themes and applying base styling.",
  "frontend/index.html": "Main HTML entry configuring PWA metadata, icons, and service worker registration with auto-update logic.",
  "frontend/public/manifest.json": "PWA manifest defining metadata, icons, theme colors, and display mode.",
  "frontend/public/service-worker.js": "Service worker handling caching, update logic, and fetch strategies with versioned cache invalidation.",
  "frontend/src/App.tsx": "Root React component providing theme support and rendering the dashboard with notifications.",
  "frontend/src/components/ChronographTimer.tsx": "Chronograph timer managing timed sessions, persistence, study logging, and displaying related study components.",
  "frontend/src/components/DailyQuote.tsx": "Displays the daily quote using data from useQuote with loading skeleton and styled card UI.",
  "frontend/src/components/DaysRemaining.tsx": "Computes and displays days remaining until a goal date, updating every minute and reacting to goal updates.",
  "frontend/src/components/ExecutionScore.tsx": "Displays an execution score based on today's logged hours, with conditional states and tiered scoring labels.",
  "frontend/src/components/FailureAlert.tsx": "Shows timed alerts if today has zero hours by 9PM or if yesterday was missed, checking every minute.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/ForwardLifeClock.tsx": "Displays a live updating 'life clock' showing day of year, date, and time with animated digit transitions.",
  "frontend/src/components/GoalEditor.tsx": "Provides a dialog to configure and save goal settings, updating localStorage and emitting a goalUpdated event.",
  "frontend/src/components/NotificationManager.tsx": "Manages notification permissions and sends periodic reminders if no study hours are logged.",
  "frontend/src/components/NoZeroDaysIndicator.tsx": "Shows a small status indicator marking whether the day has zero study hours or is active.",
  "frontend/src/components/PsychologicalTriggerBar.tsx": "Displays a persistent bar showing remaining days until the goal, updating on interval and goal changes.",
  "frontend/src/components/ReverseLifeClock.tsx": "Countdown timer component that tracks remaining time toward a goal and updates every second, with animated digit changes and a goal editor.",
  "frontend/src/components/StreakDisplay.tsx": "Shows current and longest study streaks using query hooks, with visual indicators for broken streaks.",
  "frontend/src/components/StudyHeatmap.tsx": "Renders a weekly heatmap of study hours with tooltips and live updates from study session events.",
  "frontend/src/components/StudyProgressBarChart.tsx": "Displays a bar chart of daily study hours for the last 30 days with dynamic coloring and live refresh.",
  "frontend/src/components/StudyTracker.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ThemeModeDialog.tsx": "Modal dialog allowing users to select light, dark, or system theme using radio buttons.",
  "frontend/src/components/TimeBasedMessage.tsx": "Shows a motivational badge message based on the current time of day.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication provider and hook wrapping Dfinity Internet Identity, managing identity load, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for fetching a daily quote with caching and day rollover checks, and managing study session data stored in localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles, light/dark theme CSS variables, utility classes, and global typography and background rules.",
  "frontend/src/lib/studyActivityColors.ts": "Exports color constants and helper functions to map study hours to activity levels and corresponding colors.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard layout including clocks, quote, timer, metrics, and theme dialog, updating time every second.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, color tokens, breakpoints, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, known issues, and active feature requests related to responsive layout and daily quote updates."
}