{
  "kind": "build_request",
  "title": "Fix desktop responsive layout and ensure DailyQuote refreshes at each new calendar day",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the responsive layout so the dashboard renders its intended desktop layout on large screens (e.g., `lg:grid-cols-2` and `lg:grid-cols-3` in `frontend/src/pages/Dashboard.tsx`) instead of remaining in a phone/mobile layout on desktop, without changing the existing visual design, component structure, or content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The app is in phone view I want the app in desktop view"
        ]
      },
      "acceptanceCriteria": [
        "On a desktop viewport width ≥ 1024px, the dashboard uses the multi-column grid layouts defined with `lg:*` classes (e.g., clocks display in two columns; the quote/stats section uses three columns).",
        "On mobile widths, the layout remains single-column as it is today.",
        "No redesign: no intentional changes to typography, spacing scale, colors, card styles, or component composition beyond what is required to make the desktop breakpoint apply."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the daily quote behavior so the quote automatically updates when the calendar day changes (including when the tab remains open past midnight), while preserving the existing localStorage cache behavior and keeping the DailyQuote UI/markup unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the daily quotes which is right below forward clock is not updating with new quotes daily so please update quotes daily rest keep everything as it is and do not redesign anything."
        ]
      },
      "acceptanceCriteria": [
        "If the app remains open across midnight, the DailyQuote section refreshes to a new daily quote without requiring a manual page reload.",
        "The localStorage keys currently used (`cachedQuote` and `quoteCacheDate` in `frontend/src/hooks/useQueries.ts`) remain in use, and a quote is still reused within the same calendar day.",
        "DailyQuote’s visual output/structure remains unchanged (no changes to layout/markup besides any minimal wiring needed to trigger refresh)."
      ]
    }
  ],
  "constraints": [
    "Do not redesign the UI; keep layout/design/components as-is except for the minimal changes required to make desktop breakpoints apply and to refresh the daily quote on day change.",
    "Do not edit files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new features beyond the desktop breakpoint fix and daily quote auto-refresh behavior (e.g., new quote feeds, user accounts, new dashboard sections).",
    "Changing the quote visual styling, card design, or typography."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}