{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix dashboard desktop breakpoint behavior and refresh DailyQuote at calendar day rollover",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the Dashboard uses its existing `lg:*` multi-column grid layouts on desktop widths without changing visual design or component composition.",
      "acceptanceCriteria": [
        "On a desktop viewport width ≥ 1024px, the dashboard uses the multi-column grid layouts defined with `lg:*` classes (e.g., clocks display in two columns; the quote/stats section uses three columns).",
        "On mobile widths, the layout remains single-column as it is today.",
        "No redesign: no intentional changes to typography, spacing scale, colors, card styles, or component composition beyond what is required to make the desktop breakpoint apply."
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Explicitly define Tailwind responsive `screens` (including `lg: 1024px`) so `lg:*` variants reliably compile/apply at desktop widths; keep existing theme extensions and visual tokens unchanged."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Make minimal, non-visual wiring adjustments needed to ensure the existing `lg:grid-cols-2` and `lg:grid-cols-3` classes take effect on large screens (no changes to layout structure/content beyond what’s required to restore the intended desktop breakpoint behavior)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Auto-refresh the cached DailyQuote when the local calendar day changes (including while the tab remains open), preserving existing localStorage keys and UI markup.",
      "acceptanceCriteria": [
        "If the app remains open across midnight, the DailyQuote section refreshes to a new daily quote without requiring a manual page reload.",
        "The localStorage keys currently used (`cachedQuote` and `quoteCacheDate` in `frontend/src/hooks/useQueries.ts`) remain in use, and a quote is still reused within the same calendar day.",
        "DailyQuote’s visual output/structure remains unchanged (no changes to layout/markup besides any minimal wiring needed to trigger refresh)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a day-rollover mechanism (e.g., a computed 'today' value that updates at the next local midnight and/or on focus) and incorporate it into the React Query behavior (e.g., queryKey invalidation or keying by day) so `useQuote()` refetches on calendar day change while continuing to use `cachedQuote` and `quoteCacheDate` for same-day reuse."
        }
      ]
    }
  ]
}